app/controllers/main_controller.rb

  def landing
    @user = User.find_by_id(session[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1