app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."oauth_token" = '8vbfEt7MXEMvQlfH2iaTbU5SsaAJBTIAyr4fgf36o' LIMIT 1
INSERT INTO "users" ("created_at", "oauth_secret", "oauth_token", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
---
  def auth
    @access_token = request_token.get_access_token(:oauth_verifier => params[:oauth_verifier])
    session.delete(:request_token)
    @user = User.find_by_oauth_token(params[:oauth_token])

    if @user
      @user.update_attributes(oauth_token: @access_token.token, oauth_secret: @access_token.secret)
    else
      @user = User.create(id: @access_token.params[:user_id], oauth_token: @access_token.token, oauth_secret: @access_token.secret)